---
kind: method
id: M:Autodesk.Revit.DB.TemporaryViewModes.IsCustomized
source: html/c7177927-a0b0-0811-675e-87156d8ac40f.htm
---
# Autodesk.Revit.DB.TemporaryViewModes.IsCustomized Method

Identifies if a custom temporary view mode is currently active.
 A custom mode is active if there is a non-empty string set for CustomTitle .

## Syntax (C#)
```csharp
public bool IsCustomized()
```

## Returns
Returns true a custom temporary view mode is currently active, false otherwise.
 A custom mode is active if there is a non-empty string set for CustomTitle .